# #  1. Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# #     Пример:
# #     [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# a = list(map(int, input().split()))
# b = []
# b = list(map(int, b))  

# def summa(data, data2):
#     for i in range(0, len(data)):
#         if i % 2:
#             data2.append(data[i])
#     print(sum(data2))
#     return data2 


# print(summa(a, b))


# # 2. Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# #   Пример:
# #     [2, 3, 4, 5, 6] => [12, 15, 16];
# #     [2, 3, 5, 6] => [12, 15]

# a = [2, 5, 4, 8, 6, 7]
# print(len(a))
# if len(a) % 2:
#     b = len(a)//2 + 1
# else:
#     b = len(a)//2

# print(b)

# c = []
# c = list(map(int, c)) 

# for i in range(0, b):
#     c.append(a[i] + a[-i-1])
# print(c)

# # 3. Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# #    Пример:
# #          [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# a = [1.1, 1.2, 3.1, 10.01]
# b = []


# for i in a:
#     b.append(round(i % 1, 10))

# max = b[0]
# min = b[0]

# for i in range(0, len(b)-1):
#     if b[i + 1] > max:
#         max = b[i + 1]
#     elif b[i + 1] < min:
#         min = b[i + 1]


# print(max - min)


# # 4. Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# #    Пример:
# #    45 -> 101101
# #    3 -> 11
# #    2 -> 10

# a = int(input('enter number = '))
# b = ''
# while a > 0:
#     b = str(a % 2) + b
#     a = a // 2
   
# print(b)

# 5. Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

a = int(input('enter number = '))
c = [1, 0, 1]




for i in range (1, a):
    b = c[i] + c[i+1]
    c.append(b)

for i in range (0, a-1):
    b = c[1] - c[0]
    c.insert(0, b)
    

print(c)